docs/plans/evidence/2026-09-23-runbook-v2-validation/lanes/micro-claims/claim1/instrument_check/wrk2_w1_none_r2000/wrk2_measure.txt
Running 20s test @ http://10.160.0.35:8300/v1/chat/completions
  4 threads and 64 connections
  Thread calibration: mean lat.: 0.815ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.853ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.749ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.800ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   844.80us    2.89ms 234.75ms   99.95%
    Req/Sec   527.55     94.86     1.30k    75.84%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  762.00us
 75.000%    1.10ms
 90.000%    1.33ms
 99.000%    1.84ms
 99.900%    2.06ms
 99.990%  171.13ms
 99.999%  234.88ms
100.000%  234.88ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.107     0.000000            1         1.00
       0.272     0.100000         1991         1.11
       0.396     0.200000         3975         1.25
       0.515     0.300000         5955         1.43
       0.628     0.400000         7953         1.67
       0.762     0.500000         9934         2.00
       0.830     0.550000        10924         2.22
       0.905     0.600000        11907         2.50
       0.977     0.650000        12912         2.86
       1.038     0.700000        13910         3.33
       1.098     0.750000        14886         4.00
       1.123     0.775000        15389         4.44
       1.151     0.800000        15878         5.00
       1.180     0.825000        16384         5.71
       1.219     0.850000        16871         6.67
       1.264     0.875000        17373         8.00
       1.290     0.887500        17613         8.89
       1.326     0.900000        17861        10.00
       1.368     0.912500        18106        11.43
       1.418     0.925000        18355        13.33
       1.468     0.937500        18602        16.00
       1.496     0.943750        18728        17.78
       1.525     0.950000        18850        20.00
       1.563     0.956250        18973        22.86
       1.599     0.962500        19099        26.67
       1.641     0.968750        19221        32.00
       1.667     0.971875        19284        35.56
       1.691     0.975000        19344        40.00
       1.724     0.978125        19406        45.71
       1.756     0.981250        19470        53.33
       1.782     0.984375        19531        64.00
       1.794     0.985938        19562        71.11
       1.810     0.987500        19592        80.00
       1.831     0.989062        19623        91.43
       1.848     0.990625        19654       106.67
       1.861     0.992188        19685       128.00
       1.885     0.992969        19702       142.22
       1.897     0.993750        19716       160.00
       1.926     0.994531        19732       182.86
       1.948     0.995313        19748       213.33
       1.968     0.996094        19765       256.00
       1.973     0.996484        19771       284.44
       1.988     0.996875        19778       320.00
       2.001     0.997266        19786       365.71
       2.013     0.997656        19794       426.67
       2.024     0.998047        19802       512.00
       2.032     0.998242        19807       568.89
       2.033     0.998437        19809       640.00
       2.037     0.998633        19813       731.43
       2.051     0.998828        19817       853.33
       2.071     0.999023        19821      1024.00
       2.101     0.999121        19824      1137.78
       2.107     0.999219        19825      1280.00
       2.121     0.999316        19828      1462.86
       2.125     0.999414        19829      1706.67
       4.967     0.999512        19831      2048.00
       5.355     0.999561        19832      2275.56
      11.623     0.999609        19833      2560.00
      43.519     0.999658        19834      2925.71
      75.455     0.999707        19835      3413.33
     107.327     0.999756        19836      4096.00
     107.327     0.999780        19836      4551.11
     139.263     0.999805        19837      5120.00
     139.263     0.999829        19837      5851.43
     171.135     0.999854        19838      6826.67
     171.135     0.999878        19838      8192.00
     171.135     0.999890        19838      9102.22
     203.007     0.999902        19839     10240.00
     203.007     0.999915        19839     11702.86
     203.007     0.999927        19839     13653.33
     203.007     0.999939        19839     16384.00
     203.007     0.999945        19839     18204.44
     234.879     0.999951        19840     20480.00
     234.879     1.000000        19840          inf
#[Mean    =        0.845, StdDeviation   =        2.892]
#[Max     =      234.752, Total count    =        19840]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------

  Latency Distribution (HdrHistogram - Uncorrected Latency (measured without taking delayed starts into account))
 50.000%  124.00us
 75.000%  159.00us
 90.000%  201.00us
 99.000%  320.00us
 99.900%  430.00us
 99.990%    4.74ms
 99.999%  233.98ms
100.000%  233.98ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.095     0.000000            5         1.00
       0.111     0.100000         2213         1.11
       0.115     0.200000         4225         1.25
       0.118     0.300000         6033         1.43
       0.121     0.400000         8360         1.67
       0.124     0.500000        10401         2.00
       0.126     0.550000        11364         2.22
       0.128     0.600000        12061         2.50
       0.132     0.650000        12958         2.86
       0.140     0.700000        13891         3.33
       0.159     0.750000        14922         4.00
       0.168     0.775000        15444         4.44
       0.174     0.800000        15910         5.00
       0.179     0.825000        16379         5.71
       0.185     0.850000        16879         6.67
       0.191     0.875000        17375         8.00
       0.196     0.887500        17652         8.89
       0.201     0.900000        17889        10.00
       0.206     0.912500        18113        11.43
       0.212     0.925000        18364        13.33
       0.221     0.937500        18601        16.00
       0.228     0.943750        18724        17.78
       0.236     0.950000        18848        20.00
       0.243     0.956250        18974        22.86
       0.250     0.962500        19097        26.67
       0.258     0.968750        19229        32.00
       0.263     0.971875        19288        35.56
       0.270     0.975000        19344        40.00
       0.279     0.978125        19406        45.71
       0.289     0.981250        19468        53.33
       0.298     0.984375        19534        64.00
       0.304     0.985938        19563        71.11
       0.310     0.987500        19594        80.00
       0.316     0.989062        19625        91.43
       0.325     0.990625        19658       106.67
       0.333     0.992188        19686       128.00
       0.340     0.992969        19705       142.22
       0.345     0.993750        19717       160.00
       0.351     0.994531        19732       182.86
       0.358     0.995313        19748       213.33
       0.369     0.996094        19764       256.00
       0.372     0.996484        19774       284.44
       0.374     0.996875        19778       320.00
       0.380     0.997266        19786       365.71
       0.385     0.997656        19795       426.67
       0.396     0.998047        19803       512.00
       0.405     0.998242        19806       568.89
       0.413     0.998437        19809       640.00
       0.419     0.998633        19813       731.43
       0.424     0.998828        19817       853.33
       0.434     0.999023        19822      1024.00
       0.444     0.999121        19823      1137.78
       0.450     0.999219        19825      1280.00
       0.451     0.999316        19827      1462.86
       0.459     0.999414        19829      1706.67
       0.487     0.999512        19831      2048.00
       0.500     0.999561        19832      2275.56
       0.502     0.999609        19833      2560.00
       0.517     0.999658        19834      2925.71
       0.531     0.999707        19835      3413.33
       0.600     0.999756        19836      4096.00
       0.600     0.999780        19836      4551.11
       2.719     0.999805        19837      5120.00
       2.719     0.999829        19837      5851.43
       4.739     0.999854        19838      6826.67
       4.739     0.999878        19838      8192.00
       4.739     0.999890        19838      9102.22
       4.895     0.999902        19839     10240.00
       4.895     0.999915        19839     11702.86
       4.895     0.999927        19839     13653.33
       4.895     0.999939        19839     16384.00
       4.895     0.999945        19839     18204.44
     233.983     0.999951        19840     20480.00
     233.983     1.000000        19840          inf
#[Mean    =        0.156, StdDeviation   =        1.661]
#[Max     =      233.856, Total count    =        19840]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  39956 requests in 20.00s, 14.40MB read
Requests/sec:   1997.67
Transfer/sec:    737.42KB