docs/plans/evidence/2026-09-23-runbook-v2-validation/lanes/micro-claims/claim1/instrument_check/wrk2_w1_none_r2000/wrk2_warmup.txt
Running 5s test @ http://10.160.0.35:8300/v1/chat/completions
  4 threads and 64 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   790.58us  443.73us   4.54ms   65.37%
    Req/Sec       -nan      -nan   0.00      0.00%
  9959 requests in 5.00s, 3.59MB read
Requests/sec:   1991.53
Transfer/sec:    735.15KB